# How to select pandas series from DataFrame

In [1]:
import pandas as pd

In [2]:
data = pd.read_table('title.ratings.tsv')
data.head()

      tconst  averageRating  numVotes
0  tt0000001            5.8      1435
1  tt0000002            6.3       170
2  tt0000003            6.6      1030
3  tt0000004            6.4       101
4  tt0000005            6.2      1728

In [3]:
#Accessing pandas series using dot (.) operator
data.averageRating.head()

0    5.8
1    6.3
2    6.6
3    6.4
4    6.2
Name: averageRating, dtype: float64

In [4]:
#Accessing pandas series using []
data['averageRating'].head()

0    5.8
1    6.3
2    6.6
3    6.4
4    6.2
Name: averageRating, dtype: float64

In [5]:
#if the coulumn name has space we cannot use (.) operator to access the series. We need to use []
#And also while creating new column we have to use [] and not (.)

data['new column'] = data.averageRating

In [6]:
data.head()

      tconst  averageRating  numVotes  new column
0  tt0000001            5.8      1435         5.8
1  tt0000002            6.3       170         6.3
2  tt0000003            6.6      1030         6.6
3  tt0000004            6.4       101         6.4
4  tt0000005            6.2      1728         6.2

In [7]:
#So here if we want to access the new column we have to use the [] and not (.)
data['new column'].head()

0    5.8
1    6.3
2    6.6
3    6.4
4    6.2
Name: new column, dtype: float64